{
    "ELIXIR": "Функциональный, распределённый язык программирования общего назначения, который работает на виртуальной машине Erlang (BEAM).",
    "WEB-SERVERS": "Сервер, принимающий HTTP-запросы от клиентов, обычно веб-браузеров, и выдающий им HTTP-ответы, как правило, вместе с HTML-страницей, изображением, файлом, медиа-потоком или другими данными.",
    "NGINX": "Веб-сервер и почтовый прокси-сервер, работающий на Unix-подобных операционных системах.",
    "APACHE": "Свободный веб-сервер",
    "COWBOY": "Небольшой, быстрый и современный HTTP-сервер для Erlang / OTP",
    "HTTP": "Широко распространённый протокол передачи данных, изначально предназначенный для передачи гипертекстовых документов.",
    "FRAMEWORK": "Программная платформа, определяющая структуру программной системы;",
    "PHOENIX": "Фреймворк для веб-разработки, написанный на языке функционального программирования Elixir",
    "RUNTIME": "Среда выполнения кода Elixir",
    "EPMD": "Erlang Port Mapper Daemon, Демон сопоставления портов Erlang",
    "ERTS": "Виртуальная машина Erlang.",
    "DISTILLERY": " Предназначен для автоматизации генерации релизов Elixir проектов",
    "PG2": "Распределенные именованные группы процессов.",
    "PUBSUB": "Служба, позволяющая реализовать подписки в реальном времени",
    "SUPERVISION": "Контроллирует дочерние процессы.",
    "SUPERVISIONTREE": "В приложениях Erlang и Elixir структура определяется наличием процессов «супервизора» верхнего уровня, которые запускают другие процессы в вашем приложении. Эти другие процессы могут включать в себя других супервизоров, у которых также есть свои дочерние элементы, и эта рекурсивная структура принимает форму дерева, отсюда «дерево супервизоров». ",
    "UMBRELLA": "Позволяет разделить логику приложения на отдельные независимые микросервисы",
    "DOCKER": "Программное обеспечение для автоматизации развёртывания и управления приложениями в средах с поддержкой контейнеризации. Позволяет «упаковать» приложение со всем его окружением и зависимостями в контейнер, который может быть перенесён на любую Linux-систему с поддержкой cgroups в ядре, а также предоставляет среду по управлению контейнерами. ",
    "KUBERNETES": "Открытое программное обеспечение для автоматизации развёртывания, масштабирования контейнеризированных приложений и управления ими. Поддерживает основные технологии контейнеризации, включая Docker, rkt, также возможна поддержка технологий аппаратной виртуализации. ",
    "ETS": "Erlang Term Storage мощный инструмент для хранения данных (ключ-значение)",
    "REDIS": "Резидентная система управления базами данных класса NoSQL с открытым исходным кодом, работающая со структурами данных типа «ключ — значение».",
    "MNESIA": "Mnesia — это распределённая система управления базами данных реального времени.",
    "AGENTS": "Обертка для хранения состояний",
    "GENSERVER": "Открытое программное обеспечение для автоматизации развёртывания, масштабирования контейнеризированных приложений и управления ими. Поддерживает основные технологии контейнеризации, включая Docker, rkt, также возможна поддержка технологий аппаратной виртуализации. ",
    "GITLAB": "Веб-инструмент жизненного цикла DevOps с открытым исходным кодом, представляющий систему управления репозиториями кода для Git с собственной вики, системой отслеживания ошибок, CI/CD пайплайном и другими функциями.",
    "GITHUB": "Крупнейший веб-сервис для хостинга IT-проектов и их совместной разработки.",
    "BITBUCKET": "Веб-сервис для хостинга проектов и их совместной разработки, основанный на системах контроля версий Mercurial и Git.",
    "MONGODB": "Документоориентированная система управления базами данных, не требующая описания схемы таблиц.",
    "ORACLE_NOSQL": "распределенная база данных значений ключей типа NoSQL от Oracle Corporation.",
    "POSTGRESQL": "Свободная объектно-реляционная система управления базами данных. ",
    "MYSQL": "Свободная реляционная система управления базами данных.",
    "MSSQL": "Система управления реляционными базами данных, разработанная корпорацией Microsoft.",
    "ORACLE": "объектно-реляционная система управления базами данных компании Oracle.",
    "MARIADB": "Открытое программное обеспечение для автоматизации развёртывания, масштабирования контейнеризированных приложений и управления ими. Поддерживает основные технологии контейнеризации, включая Docker, rkt, также возможна поддержка технологий аппаратной виртуализации. ",
    "ВЕБ-СЕРВИС": "Технология, программная система, позволяющая системам обмениваться данными друг с другом через сетевое подключение.",
    "КЛИЕНТ-СЕРВЕР": "Вычислительная или сетевая архитектура, в которой задания или сетевая нагрузка распределены между поставщиками услуг (сервисов), называемыми серверами, и заказчиками услуг, называемыми клиентами.",
    "МОДЕЛЬ": "Система, исследование которой служит средством для получения информации о другой системе; представление некоторого реального процесса, устройства или концепции.",
    "МИГРАЦИЯ": "Переход от одной структуры БД к другой без потери консистентности",
    "КОНСИСТЕНТНОСТЬ": "Согласованность данных друг с другом, целостность данных, а также внутренняя непротиворечивость.",
    "ПРОТОКОЛ": "Стандарт, описывающий правила взаимодействия функциональных блоков при передаче данных",
    "АРХИТЕКТУРА": "Структура программы или вычислительной системы, определяющая ее работу на самом высоком концептуальном уровне, включая аппаратные и программные компоненты, видимые снаружи свойства этих компонентов, отношения между ними, а также документирование системы.",
    "TCP": "Один из основных протоколов передачи данных интернета, предназначенный для управления передачей данных, с гарантией доставки и сохранения порядка следования пакетов.",
    "DRY": "Принцип разработки программного обеспечения, нацеленный на снижение повторения информации различного рода, особенно в системах со множеством слоёв абстрагирования.",
    "API": "Набор команд, функций, протоколов и объектов, которые программисты могут использовать для создания программного обеспечения или взаимодействия с внешней системой",
    "SQL": "Декларативный язык программирования, применяемый для создания, модификации и управления данными в реляционной базе данных, управляемой соответствующей системой управления базами данных.",
    "SQL_INJECTION": "Один из распространённых способов взлома сайтов и программ, работающих с базами данных, основанный на внедрении в запрос произвольного SQL-кода.",
    "JAVASCRIPT": "Это мультипарадигменный язык программирования, который даёт возможность реализовывать сложное поведение веб-страницы. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.",
    "ECTO": "Интерфейс для работы с базами данных на Elixir.",
    "PYTHON": "Высокоуровневый язык программирования общего назначения, ориентированный на повышение производительности разработчика и читаемости кода.",
    "Django": "MVC Фреймворк на языке Python",
    "MVC": "Схема разделения данных приложения, пользовательского интерфейса и управляющей логики на три отдельных компонента: модель, представление и контроллер",
    "Django ORM": "Механизм объектно-ориентированного отображения.  Технология программирования, которая связывает базы данных с концепциями объектно-ориентированных языков программирования, создавая «виртуальную объектную базу данных."
    }